166382
0	215	215
1	215	215
2	2	2
3	2	2
4	2	2
5	2	2
6	2	2
7	2	2
8	1	1
9	7	7
10	5	5
11	2	2
12	5	5
13	3	3
14	3	3
15	2	2
16	2	2
17	2	2
18	2	2
19	2	2
20	2	2
21	2	2
22	2	2
23	1	1
24	2	2
25	2	2
26	3	3
27	7	7
28	2	2
29	2	2
30	3	3
31	2	2
32	2	2
33	3	3
34	3	3
35	2	2
36	2	2
37	2	2
38	2	2
39	2	2
40	2	2
41	5	5
42	2	2
43	2	2
44	1	1
45	2	2
46	2	2
47	3	3
48	5	5
49	5	5
50	5	5
51	16	16
52	3	3
53	4	4
54	2	2
55	9	9
56	2	2
57	2	2
58	3	3
59	2	2
60	1	1
61	1	1
62	6	6
63	3	3
64	3	3
65	1	1
66	1	1
67	2	2
68	2	2
69	2	2
70	2	2
71	2	2
72	2	2
73	12	12
74	5	5
75	6	6
76	3	3
77	213	213
78	10	10
79	11	11
80	215	215
81	3	3
82	4	4
83	2	2
84	4	4
85	117	117
86	217	217
87	2	2
88	1	1
89	6	6
90	4	4
91	4	4
92	6	6
93	4	4
94	8	8
95	7	7
96	296	296
97	213	213
98	213	213
99	25	25
100	13	13
101	7	7
102	1	1
103	13	13
104	14	14
105	4	4
106	26	26
107	3	3
108	12	12
109	1	1
110	5	5
111	284	284
112	3	3
113	6	6
114	1	1
115	4	4
116	33	33
117	13	13
118	2	2
119	89	89
120	103	103
121	23	23
122	15	15
123	25	25
124	8	8
125	12	12
126	8	8
127	186	186
128	2	2
129	9	9
130	3	3
131	8	8
132	4	4
133	1	1
134	2	2
135	1	1
136	7	7
137	6	6
138	25	25
139	5	5
140	2	2
141	36	36
142	6	6
143	4	4
144	38	38
145	4	4
146	2	2
147	1	1
148	2	2
149	2	2
150	11	11
151	1	1
152	328	328
153	15	15
154	27	27
155	9	9
156	6	6
157	18	18
158	2	2
159	12	12
160	201	201
161	5	5
162	10	10
163	121	121
164	2	2
165	51	51
166	33	33
167	1	1
168	5	5
169	9	9
170	2	2
171	1	1
172	3	3
173	1	1
174	217	217
175	21	21
176	494	494
177	46	46
178	7	7
179	89	89
180	15	15
181	4	4
182	13	13
183	8	8
184	6	6
185	2	2
186	9	9
187	13	13
188	2	2
189	2	2
190	3	3
191	4	4
192	27	27
193	2	2
194	2	2
195	4	4
196	6	6
197	6	6
198	4	4
199	6	6
200	38	38
201	6	6
202	3	3
203	4	4
204	86	86
205	215	215
206	4	4
207	1	1
208	8	8
209	8	8
210	33	33
211	1	1
212	2	2
213	4	4
214	143	143
215	3	3
216	13	13
217	7	7
218	1	1
219	7	7
220	4	4
221	46	46
222	296	296
223	8	8
224	1115	1115
225	5	5
226	9	9
227	3	3
228	11	11
229	1	1
230	213	213
231	69	69
232	2	2
233	2	2
234	2	2
235	95	95
236	2	2
237	3	3
238	1	1
239	50	50
240	64	64
241	23	23
242	13	13
243	136	136
244	46	46
245	148	148
246	15	15
247	1	1
248	4	4
249	1	1
250	9	9
251	92	92
252	13	13
253	3	3
254	2	2
255	12	12
256	138	138
257	12	12
258	10	10
259	4	4
260	39	39
261	39	39
262	1	1
263	1	1
264	16	16
265	1	1
266	7	7
267	1	1
268	1	1
269	26	26
270	13	13
271	1	1
272	115	115
273	11	11
274	39	39
275	22	22
276	72	72
277	3	3
278	1	1
279	9	9
280	2	2
281	18	18
282	1	1
283	1	1
284	1	1
285	13	13
286	2	2
287	1	1
288	1	1
289	3	3
290	1	1
291	2	2
292	3	3
293	1	1
294	1	1
295	1	1
296	2	2
297	4	4
298	1	1
299	46	46
300	23	23
301	13	13
302	2	2
303	2	2
304	1	1
305	59	59
306	1	1
307	2	2
308	1	1
309	99	99
310	1	1
311	13	13
312	54	54
313	1	1
314	205	205
315	32	32
316	46	46
317	10	10
318	1930	1930
319	2	2
320	2	2
321	13	13
322	3	3
323	17	17
324	1	1
325	1	1
326	171	171
327	10	10
328	27	27
329	1	1
330	4	4
331	5	5
332	23	23
333	23	23
334	23	23
335	2	2
336	6	6
337	5	5
338	4	4
339	1	1
340	22	22
341	1	1
342	3	3
343	1	1
344	3	3
345	3	3
346	6	6
347	1	1
348	5	5
349	9	9
350	6	6
351	36	36
352	26	26
353	2	2
354	13	13
355	169	169
356	13	13
357	5	5
358	17	17
359	1	1
360	19	19
361	14	14
362	2	2
363	64	64
364	7	7
365	3	3
366	3	3
367	6	6
368	51	51
369	1	1
370	4	4
371	5	5
372	2	2
373	1	1
374	5	5
375	4	4
376	10	10
377	9	9
378	16	16
379	3	3
380	2	2
381	13	13
382	13	13
383	14	14
384	16	16
385	26	26
386	26	26
387	8	8
388	2	2
389	2	2
390	2	2
391	3	3
392	160	160
393	10	10
394	25	25
395	197	197
396	69	69
397	21	21
398	71	71
399	13	13
400	1	1
401	8	8
402	388	388
403	23	23
404	12	12
405	4	4
406	4	4
407	6	6
408	34	34
409	4	4
410	23	23
411	1	1
412	11	11
413	1	1
414	1	1
415	5	5
416	26	26
417	59	59
418	4	4
419	217	217
420	10	10
421	9	9
422	4	4
423	2	2
424	13	13
425	3	3
426	80	80
427	15	15
428	13	13
429	14	14
430	2	2
431	1	1
432	2	2
433	2	2
434	36	36
435	105	105
436	8	8
437	5	5
438	13	13
439	52	52
440	36	36
441	1	1
442	95	95
443	3	3
444	2	2
445	3	3
446	1	1
447	1	1
448	4	4
449	10	10
450	6	6
451	1	1
452	3	3
453	266	266
454	3	3
455	3	3
456	2	2
457	3	3
458	15	15
459	27	27
460	6	6
461	27	27
462	190	190
463	6	6
464	2	2
465	2	2
466	4	4
467	6	6
468	85	85
469	24	24
470	1	1
471	2	2
472	1	1
473	6	6
474	9	9
475	5	5
476	1	1
477	13	13
478	20	20
479	11	11
480	35	35
481	2	2
482	2	2
483	14	14
484	4	4
485	1	1
486	26	26
487	7	7
488	1	1
489	1	1
490	3	3
491	33	33
492	9	9
493	2	2
494	1	1
495	2	2
496	1	1
497	12	12
498	1	1
499	609	609
500	53	53
501	16	16
502	12	12
503	3	3
504	2	2
505	10	10
506	3	3
507	1	1
508	6	6
509	3	3
510	2	2
511	13	13
512	1	1
513	9	9
514	1	1
515	18	18
516	4	4
517	2	2
518	2	2
519	2	2
520	23	23
521	46	46
522	16	16
523	23	23
524	40	40
525	7	7
526	2	2
527	6	6
528	18	18
529	4	4
530	23	23
531	4	4
532	4	4
533	6	6
534	2	2
535	2	2
536	2	2
537	1	1
538	2	2
539	23	23
540	2	2
541	6	6
542	9	9
543	6	6
544	3	3
545	5	5
546	3	3
547	2	2
548	6	6
549	30	30
550	5	5
551	8	8
552	4	4
553	6	6
554	17	17
555	4	4
556	3	3
557	6	6
558	2	2
559	1	1
560	3	3
561	2	2
562	115	115
563	11	11
564	10	10
565	4	4
566	10	10
567	10	10
568	2	2
569	4	4
570	19	19
571	36	36
572	3	3
573	13	13
574	75	75
575	28	28
576	346	346
577	1	1
578	2	2
579	1	1
580	23	23
581	4	4
582	13	13
583	13	13
584	37	37
585	38	38
586	23	23
587	75	75
588	155	155
589	137	137
590	4	4
591	6	6
592	2	2
593	4	4
594	27	27
595	11	11
596	1	1
597	6	6
598	39	39
599	13	13
600	25	25
601	11	11
602	23	23
603	956	956
604	3	3
605	54	54
606	4	4
607	23	23
608	23	23
609	2	2
610	17	17
611	25	25
612	110	110
613	15	15
614	91	91
615	1113	1113
616	12	12
617	99	99
618	29	29
619	13	13
620	2	2
621	60	60
622	772	772
623	23	23
624	4	4
625	16	16
626	119	119
627	94	94
628	180	180
629	4	4
630	49	49
631	149	149
632	4	4
633	2	2
634	1381	1381
635	2	2
636	20	20
637	321	321
638	2	2
639	8	8
640	32	32
641	12	12
642	3	3
643	5	5
644	44	44
645	6	6
646	23	23
647	1	1
648	23	23
649	23	23
650	27	27
651	8	8
652	3	3
653	3	3
654	42	42
655	46	46
656	25	25
657	4	4
658	1	1
659	72	72
660	37	37
661	2	2
662	46	46
663	13	13
664	46	46
665	9	9
666	10	10
667	36	36
668	2	2
669	10	10
670	30	30
671	1	1
672	2232	2232
673	12	12
674	2	2
675	6	6
676	11	11
677	2	2
678	13	13
679	2	2
680	13	13
681	2	2
682	5	5
683	2	2
684	2	2
685	3	3
686	1	1
687	1	1
688	36	36
689	13	13
690	13	13
691	6	6
692	6	6
693	36	36
694	3	3
695	13	13
696	23	23
697	4	4
698	23	23
699	11	11
700	13	13
701	8	8
702	4	4
703	4	4
704	186	186
705	23	23
706	12	12
707	21	21
708	10	10
709	1	1
710	2	2
711	1	1
712	4	4
713	2	2
714	8	8
715	25	25
716	5	5
717	2	2
718	26	26
719	23	23
720	1	1
721	4	4
722	2	2
723	1	1
724	23	23
725	14	14
726	5	5
727	436	436
728	13	13
729	41	41
730	24	24
731	7	7
732	85	85
733	5	5
734	31	31
735	400	400
736	24	24
737	14	14
738	36	36
739	2	2
740	160	160
741	20	20
742	12	12
743	6	6
744	1	1
745	89	89
746	27	27
747	44	44
748	2	2
749	2	2
750	1	1
751	1	1
752	2	2
753	12	12
754	4	4
755	2	2
756	5	5
757	23	23
758	18	18
759	1	1
760	2	2
761	2	2
762	2	2
763	2	2
764	2	2
765	3	3
766	1	1
767	20	20
768	222	222
769	86	86
770	19	19
771	1	1
772	6	6
773	4	4
774	4	4
775	3	3
776	4	4
777	480	480
778	2	2
779	23	23
780	12	12
781	23	23
782	11	11
783	2	2
784	3	3
785	4	4
786	3	3
787	8	8
788	1	1
789	1	1
790	4	4
791	10	10
792	2	2
793	4	4
794	23	23
795	4	4
796	2	2
797	5	5
798	8	8
799	13	13
800	13	13
801	5	5
802	2	2
803	26	26
804	1	1
805	1	1
806	3	3
807	3	3
808	4	4
809	4	4
810	20	20
811	26	26
812	5	5
813	6	6
814	1	1
815	10	10
816	3	3
817	5	5
818	15	15
819	2	2
820	1	1
821	9	9
822	3	3
823	6	6
824	2	2
825	2	2
826	13	13
827	25	25
828	3	3
829	3	3
830	3	3
831	2	2
832	2	2
833	1	1
834	2	2
835	26	26
836	16	16
837	40	40
838	1	1
839	15	15
840	12	12
841	2	2
842	2	2
843	1	1
844	1	1
845	2	2
846	1	1
847	33	33
848	5	5
849	8	8
850	5	5
851	6	6
852	2	2
853	9	9
854	2	2
855	2	2
856	2	2
857	2	2
858	3	3
859	1	1
860	3	3
861	26	26
862	9	9
863	9	9
864	18	18
865	353	353
866	144	144
867	72	72
868	2	2
869	10	10
870	14	14
871	474	474
872	5	5
873	36	36
874	3	3
875	3	3
876	28	28
877	5	5
878	1	1
879	26	26
880	1	1
881	2	2
882	1	1
883	2	2
884	3	3
885	71	71
886	3	3
887	64	64
888	1	1
889	32	32
890	2	2
891	15	15
892	2	2
893	80	80
894	46	46
895	3	3
896	82	82
897	3	3
898	38	38
899	2	2
900	445	445
901	3	3
902	1	1
903	2	2
904	2	2
905	1	1
906	13	13
907	2	2
908	2	2
909	5	5
910	3	3
911	1	1
912	327	327
913	12	12
914	3	3
915	1	1
916	1	1
917	2	2
918	2	2
919	2	2
920	10	10
921	10	10
922	3	3
923	13	13
924	2	2
925	46	46
926	42	42
927	23	23
928	5	5
929	1	1
930	1	1
931	1	1
932	5	5
933	9	9
934	5	5
935	4	4
936	22	22
937	140	140
938	3	3
939	14	14
940	86	86
941	1	1
942	2	2
943	14	14
944	12	12
945	15	15
946	6	6
947	22	22
948	2	2
949	1	1
950	4	4
951	4	4
952	13	13
953	1	1
954	2	2
955	2	2
956	5	5
957	4	4
958	8	8
959	186	186
960	29	29
961	1	1
962	10	10
963	10	10
964	53	53
965	2	2
966	25	25
967	10	10
968	5	5
969	24	24
970	13	13
971	23	23
972	1	1
973	24	24
974	69	69
975	3	3
976	2	2
977	3	3
978	6	6
979	1	1
980	4	4
981	69	69
982	5	5
983	13	13
984	4	4
985	85	85
986	5	5
987	199	199
988	19	19
989	37	37
990	3	3
991	2	2
992	1	1
993	1	1
994	2	2
995	69	69
996	69	69
997	6	6
998	5	5
999	6	6
1000	15	15
1001	15	15
1002	9	9
1003	6	6
1004	85	85
1005	10	10
1006	3	3
1007	23	23
1008	1	1
1009	1	1
1010	5	5
1011	6	6
1012	1	1
1013	17	17
1014	6	6
1015	9	9
1016	13	13
1017	57	57
1018	13	13
1019	13	13
1020	121	121
1021	3	3
1022	22	22
1023	515	515
1024	33	33
1025	3	3
1026	15	15
1027	3	3
1028	7	7
1029	3	3
1030	14	14
1031	17	17
1032	23	23
1033	16	16
1034	144	144
1035	3	3
1036	87	87
1037	6	6
1038	3	3
1039	22	22
1040	2	2
1041	7	7
1042	2	2
1043	21	21
1044	24	24
1045	210	210
1046	4	4
1047	8	8
1048	18	18
1049	1	1
1050	13	13
1051	5	5
1052	3	3
1053	2	2
1054	1	1
1055	54	54
1056	16	16
1057	174	174
1058	23	23
1059	4	4
1060	1	1
1061	6	6
1062	43	43
1063	2	2
1064	1	1
1065	6	6
1066	2	2
1067	26	26
1068	1	1
1069	255	255
1070	3	3
1071	44	44
1072	52	52
1073	30	30
1074	14	14
1075	2851	2851
1076	242	242
1077	324	324
1078	12	12
1079	2	2
1080	18	18
1081	240	240
1082	16	16
1083	174	174
1084	74	74
1085	9	9
1086	6	6
1087	12	12
1088	19	19
1089	6	6
1090	2	2
1091	4	4
1092	19	19
1093	2	2
1094	58	58
1095	67	67
1096	6	6
1097	2	2
1098	219	219
1099	97	97
1100	1	1
1101	6	6
1102	2	2
1103	138	138
1104	220	220
1105	26	26
1106	1	1
1107	2	2
1108	6	6
1109	2	2
1110	1	1
1111	20	20
1112	2	2
1113	2	2
1114	14	14
1115	55	55
1116	2	2
1117	13	13
1118	2	2
1119	220	220
1120	114	114
1121	172	172
1122	11	11
1123	10	10
1124	22	22
1125	4	4
1126	1	1
1127	32	32
1128	73	73
1129	204	204
1130	2	2
1131	111	111
1132	165	165
1133	4	4
1134	2	2
1135	2	2
1136	1	1
1137	5	5
1138	23	23
1139	6	6
1140	1	1
1141	32	32
1142	13	13
1143	22	22
1144	65	65
1145	102	102
1146	5	5
1147	72	72
1148	10	10
1149	2	2
1150	2	2
1151	10	10
1152	2	2
1153	1	1
1154	23	23
1155	31	31
1156	4	4
1157	115	115
1158	23	23
1159	46	46
1160	10	10
1161	5	5
1162	4	4
1163	46	46
1164	16	16
1165	10	10
1166	2	2
1167	3	3
1168	21	21
1169	38	38
1170	2	2
1171	70	70
1172	59	59
1173	3	3
1174	2	2
1175	3	3
1176	2	2
1177	2	2
1178	11	11
1179	2	2
1180	1	1
1181	21	21
1182	9	9
1183	9	9
1184	10	10
1185	70	70
1186	1	1
1187	52	52
1188	23	23
1189	36	36
1190	2	2
1191	2	2
1192	738	738
1193	1	1
1194	23	23
1195	3	3
1196	2	2
1197	10	10
1198	2	2
1199	2	2
1200	3	3
1201	2	2
1202	35	35
1203	41	41
1204	46	46
1205	1	1
1206	150	150
1207	15	15
1208	57	57
1209	18	18
1210	13	13
1211	14	14
1212	72	72
1213	5	5
1214	13	13
1215	23	23
1216	4	4
1217	3	3
1218	34	34
1219	23	23
1220	3	3
1221	14	14
1222	2	2
1223	2	2
1224	6	6
1225	1	1
1226	16	16
1227	106	106
1228	4	4
1229	1	1
1230	1	1
1231	23	23
1232	1	1
1233	6	6
1234	2	2
1235	52	52
1236	3	3
1237	23	23
1238	2	2
1239	4	4
1240	2	2
1241	1	1
1242	7	7
1243	108	108
1244	11	11
1245	2	2
1246	1	1
1247	481	481
1248	2	2
1249	1	1
1250	2	2
1251	2	2
1252	1	1
1253	8	8
1254	4	4
1255	6	6
1256	1	1
1257	2	2
1258	5	5
1259	1	1
1260	6	6
1261	1	1
1262	1	1
1263	11	11
1264	2	2
1265	1	1
1266	23	23
1267	6	6
1268	3	3
1269	1	1
1270	2	2
1271	3	3
1272	1	1
1273	2	2
1274	1	1
1275	2	2
1276	13	13
1277	12	12
1278	13	13
1279	25	25
1280	2	2
1281	26	26
1282	1	1
1283	6	6
1284	1	1
1285	1	1
1286	1	1
1287	4	4
1288	1406	1406
1289	8	8
1290	14	14
1291	27	27
1292	3	3
1293	2	2
1294	26	26
1295	1	1
1296	1	1
1297	3	3
1298	2	2
1299	2	2
1300	2	2
1301	2	2
1302	2	2
1303	2	2
1304	1	1
1305	1	1
1306	5	5
1307	23	23
1308	2	2
1309	13	13
1310	12	12
1311	15	15
1312	4	4
1313	6	6
1314	6	6
1315	23	23
1316	6	6
1317	9	9
1318	11	11
1319	13	13
1320	18	18
1321	13	13
1322	26	26
1323	26	26
1324	13	13
1325	9	9
1326	1	1
1327	2	2
1328	4	4
1329	7	7
1330	14	14
1331	2	2
1332	2	2
1333	12	12
1334	1	1
1335	1	1
1336	1	1
1337	1	1
1338	16	16
1339	4	4
1340	1	1
1341	2	2
1342	1	1
1343	2	2
1344	36	36
1345	30	30
1346	1	1
1347	1	1
1348	2	2
1349	2	2
1350	13	13
1351	4	4
1352	2	2
1353	2	2
1354	3	3
1355	12	12
1356	3	3
1357	13	13
1358	3	3
1359	6	6
1360	160	160
1361	20	20
1362	23	23
1363	82	82
1364	27	27
1365	69	69
1366	30	30
1367	13	13
1368	3	3
1369	2	2
1370	426	426
1371	426	426
1372	426	426
1373	213	213
1374	215	215
1375	213	213
1376	22	22
1377	217	217
1378	10	10
1379	6	6
1380	5	5
1381	78	78
1382	5	5
1383	54	54
1384	9	9
1385	3	3
1386	2	2
1387	73	73
1388	42	42
1389	23	23
1390	11	11
1391	2	2
1392	651	651
1393	9	9
1394	13	13
1395	1	1
1396	59	59
1397	23	23
1398	9	9
1399	2	2
1400	23	23
1401	23	23
1402	23	23
1403	4	4
1404	37	37
1405	10	10
1406	1	1
1407	23	23
1408	2	2
1409	8	8
1410	83	83
1411	224	224
1412	1	1
1413	4	4
1414	13	13
1415	2	2
1416	5	5
1417	1	1
1418	2	2
1419	2	2
1420	1	1
1421	14	14
1422	10	10
1423	101	101
1424	2	2
1425	4	4
1426	2	2
1427	162	162
1428	1	1
1429	1	1
1430	1	1
1431	2	2
1432	9	9
1433	1	1
1434	25	25
1435	10	10
1436	164	164
1437	5	5
1438	69	69
1439	6	6
1440	23	23
1441	12	12
1442	4	4
1443	13	13
1444	2	2
1445	1	1
1446	217	217
1447	2	2
1448	2	2
1449	217	217
1450	5	5
1451	46	46
1452	28	28
1453	13	13
1454	1	1
1455	2	2
1456	4	4
1457	5	5
1458	4	4
1459	2	2
1460	152	152
1461	5	5
1462	3	3
1463	46	46
1464	25	25
1465	2	2
1466	75	75
1467	3	3
1468	1	1
1469	9	9
1470	5	5
1471	4	4
1472	4	4
1473	23	23
1474	2	2
1475	23	23
1476	84	84
1477	4	4
1478	95	95
1479	7	7
1480	37	37
1481	1	1
1482	9	9
1483	1	1
1484	3	3
1485	16	16
1486	50	50
1487	2	2
1488	13	13
1489	2	2
1490	6	6
1491	44	44
1492	12	12
1493	44	44
1494	13	13
1495	69	69
1496	23	23
1497	12	12
1498	2	2
1499	126	126
1500	37	37
1501	160	160
1502	6	6
1503	145	145
1504	171	171
1505	172	172
1506	38	38
1507	911	911
1508	14	14
1509	64	64
1510	1488	1488
1511	200	200
1512	38	38
1513	2	2
1514	13	13
1515	71	71
1516	4	4
1517	13	13
1518	64	64
1519	1	1
1520	53	53
1521	23	23
1522	3	3
1523	56	56
1524	15	15
1525	25	25
1526	23	23
1527	26	26
1528	124	124
1529	2	2
1530	36	36
1531	27	27
1532	3	3
1533	42	42
1534	1	1
1535	1	1
1536	4	4
1537	1	1
1538	132	132
1539	16	16
1540	1	1
1541	3	3
1542	3	3
1543	1	1
1544	2	2
1545	59	59
1546	69	69
1547	53	53
1548	2	2
1549	74	74
1550	2	2
1551	4	4
1552	1	1
1553	27	27
1554	52	52
1555	23	23
1556	38	38
1557	41	41
1558	5	5
1559	2	2
1560	144	144
1561	1	1
1562	23	23
1563	9	9
1564	3	3
1565	4	4
1566	8	8
1567	649	649
1568	1	1
1569	16	16
1570	62	62
1571	1	1
1572	4	4
1573	2	2
1574	4	4
1575	2	2
1576	2	2
1577	13	13
1578	1	1
1579	4	4
1580	5	5
1581	10	10
1582	6	6
1583	2	2
1584	13	13
1585	2	2
1586	152	152
1587	13	13
1588	1	1
1589	18	18
1590	17	17
1591	124	124
1592	12	12
1593	2	2
1594	1	1
1595	4	4
1596	31	31
1597	1	1
1598	109	109
1599	41	41
1600	88	88
1601	4	4
1602	43	43
1603	806	806
1604	7	7
1605	86	86
1606	40	40
1607	28	28
1608	12	12
1609	42	42
1610	16	16
1611	21	21
1612	59	59
1613	4	4
1614	2	2
1615	14	14
1616	6	6
1617	13	13
1618	81	81
1619	149	149
1620	670	670
1621	6	6
1622	46	46
1623	30	30
1624	7	7
1625	25	25
1626	4395	4395
1627	2	2
1628	33	33
1629	69	69
1630	1	1
1631	89	89
1632	9	9
1633	178	178
1634	15	15
1635	1	1
1636	5	5
1637	46	46
1638	1	1
1639	1	1
1640	18	18
1641	26	26
1642	25	25
1643	709	709
1644	54	54
1645	15	15
1646	427	427
1647	48	48
1648	1404	1404
1649	13	13
1650	20	20
1651	4	4
1652	2	2
1653	8	8
1654	13	13
1655	23	23
1656	36	36
1657	36	36
1658	13	13
1659	1	1
1660	1	1
1661	1	1
1662	2	2
1663	2	2
1664	1	1
1665	4	4
1666	28	28
1667	23	23
1668	1	1
1669	2	2
1670	1	1
1671	2	2
1672	1	1
1673	7	7
1674	46	46
1675	4	4
1676	24	24
1677	14	14
1678	22	22
1679	1	1
1680	29	29
1681	1	1
1682	4	4
1683	36	36
1684	3	3
1685	6	6
1686	24	24
1687	6	6
1688	4	4
1689	13	13
1690	160	160
1691	40	40
1692	1	1
1693	2	2
1694	4	4
1695	2	2
1696	23	23
1697	23	23
1698	3	3
1699	1	1
1700	13	13
1701	4	4
1702	23	23
1703	2	2
1704	2	2
1705	2	2
1706	36	36
1707	1	1
1708	37	37
1709	81	81
1710	2	2
1711	1	1
1712	25	25
1713	5	5
1714	2	2
1715	2	2
1716	94	94
1717	243	243
1718	6	6
1719	13	13
1720	13	13
1721	2	2
1722	13	13
1723	11	11
1724	4	4
1725	4	4
1726	27	27
1727	30	30
1728	563	563
1729	48	48
1730	25	25
1731	129	129
1732	195	195
1733	1	1
1734	160	160
1735	168	168
1736	342	342
1737	47	47
1738	13	13
1739	23	23
1740	10	10
1741	24	24
1742	23	23
1743	82	82
1744	62	62
1745	325	325
1746	2	2
1747	158	158
1748	15	15
1749	13	13
1750	7	7
1751	1	1
1752	48	48
1753	28	28
1754	5	5
1755	1	1
1756	1	1
1757	2	2
1758	13	13
1759	2	2
1760	84	84
1761	489	489
1762	13	13
1763	1	1
1764	46	46
1765	23	23
1766	29	29
1767	2	2
1768	2	2
1769	2	2
1770	40	40
1771	87	87
1772	11	11
1773	2	2
1774	252	252
1775	649	649
1776	173	173
1777	95	95
1778	181	181
1779	11	11
1780	94	94
1781	2828	2828
1782	789	789
1783	63	63
1784	144	144
1785	47	47
1786	22	22
1787	185	185
1788	51	51
1789	684	684
1790	40	40
1791	20	20
1792	166	166
1793	75	75
1794	5	5
1795	46	46
1796	5	5
1797	3	3
1798	222	222
1799	57	57
1800	92	92
1801	1	1
1802	4	4
1803	983	983
1804	1	1
1805	5	5
1806	2	2
1807	5	5
1808	1	1
1809	1	1
1810	12	12
1811	54	54
1812	35	35
1813	32	32
1814	23	23
1815	13	13
1816	12	12
1817	1	1
1818	36	36
1819	4	4
1820	382	382
1821	183	183
1822	277	277
1823	6	6
1824	35	35
1825	6	6
1826	95	95
1827	124	124
1828	169	169
1829	94	94
1830	23	23
1831	162	162
1832	58	58
1833	12	12
1834	2	2
1835	26	26
1836	13	13
1837	25	25
1838	5	5
1839	13	13
1840	2	2
1841	1	1
1842	1	1
1843	16	16
1844	2	2
1845	282	282
1846	199	199
1847	65	65
1848	72	72
1849	37	37
1850	1	1
1851	3	3
1852	15	15
1853	138	138
1854	46	46
1855	16	16
1856	36	36
1857	24	24
1858	3	3
1859	4	4
1860	13	13
1861	2	2
1862	2	2
1863	20	20
1864	1	1
1865	18	18
1866	2	2
1867	4	4
1868	1	1
1869	5	5
1870	11	11
1871	8	8
1872	4	4
1873	6	6
1874	14	14
1875	11	11
1876	8	8
1877	2	2
1878	3	3
1879	15	15
1880	2	2
1881	4	4
1882	2	2
1883	2	2
1884	654	654
1885	23	23
1886	1	1
1887	163	163
1888	1	1
1889	2	2
1890	1	1
1891	162	162
1892	13	13
1893	3	3
1894	2	2
1895	13	13
1896	34	34
1897	13	13
1898	85	85
1899	25	25
1900	1231	1231
1901	16	16
1902	118	118
1903	46	46
1904	2	2
1905	13	13
1906	4	4
1907	10	10
1908	930	930
1909	23	23
1910	36	36
1911	48	48
1912	78	78
1913	84	84
1914	174	174
1915	23	23
1916	1	1
1917	6	6
1918	131	131
1919	18	18
1920	3	3
1921	2	2
1922	14	14
1923	4	4
1924	1	1
1925	2	2
1926	12	12
1927	13	13
1928	4	4
1929	4	4
1930	1	1
1931	2	2
1932	1	1
1933	2	2
1934	2	2
1935	1	1
1936	3	3
1937	2	2
1938	23	23
1939	23	23
1940	2	2
1941	4	4
1942	2	2
1943	23	23
1944	8	8
1945	1	1
1946	10	10
1947	1	1
1948	18	18
1949	67	67
1950	69	69
1951	7	7
1952	4	4
1953	1	1
1954	4	4
1955	4	4
1956	1	1
1957	72	72
1958	3	3
1959	9	9
1960	1	1
1961	2	2
1962	3	3
1963	13	13
1964	2	2
1965	69	69
1966	42	42
1967	2	2
1968	1	1
1969	2	2
1970	27	27
1971	2	2
1972	602	602
1973	1	1
1974	6	6
1975	36	36
1976	3	3
1977	1	1
1978	2	2
1979	2	2
1980	2	2
1981	24	24
1982	23	23
1983	4	4
1984	1	1
1985	84	84
1986	104	104
1987	4	4
1988	1	1
1989	267	267
1990	92	92
1991	54	54
1992	14	14
1993	2	2
1994	2	2
1995	2	2
1996	8	8
1997	38	38
1998	3	3
1999	2	2
2000	3	3
2001	6	6
2002	13	13
2003	13	13
2004	30	30
2005	2	2
2006	5	5
2007	3	3
2008	46	46
2009	23	23
2010	92	92
2011	20	20
2012	2	2
2013	18	18
2014	2	2
2015	23	23
2016	2	2
2017	8	8
2018	42	42
2019	1	1
2020	2	2
2021	2	2
2022	8	8
2023	97	97
2024	1	1
2025	40	40
2026	3	3
2027	29	29
2028	2	2
2029	13	13
2030	3	3
2031	1	1
2032	1	1
2033	6	6
2034	1	1
2035	16	16
2036	2369	2369
2037	1	1
2038	5	5
2039	6	6
2040	3	3
2041	6	6
2042	18	18
2043	13	13
2044	5	5
2045	13	13
2046	3	3
2047	6	6
2048	13	13
2049	4	4
2050	69	69
2051	106	106
2052	63	63
2053	1	1
2054	13	13
2055	6	6
2056	1	1
2057	18	18
2058	23	23
2059	4	4
2060	2	2
2061	506	506
2062	1	1
2063	2	2
2064	13	13
2065	2	2
2066	2	2
2067	13	13
2068	20	20
2069	13	13
2070	23	23
2071	2	2
2072	35	35
2073	39	39
2074	24	24
2075	6	6
2076	19	19
2077	9	9
2078	24	24
2079	1	1
2080	3	3
2081	3	3
2082	23	23
2083	6	6
2084	2	2
2085	4	4
2086	2	2
2087	26	26
2088	12	12
2089	181	181
2090	10	10
2091	69	69
2092	10	10
2093	6	6
2094	18	18
2095	47	47
2096	6	6
2097	26	26
2098	91	91
2099	6	6
2100	145	145
2101	2	2
2102	2	2
2103	4	4
2104	2	2
2105	67	67
2106	2	2
2107	1	1
2108	2	2
2109	27	27
2110	2	2
2111	138	138
2112	18	18
2113	21	21
2114	36	36
2115	2	2
2116	23	23
2117	13	13
2118	3	3
2119	2	2
2120	2	2
2121	2	2
2122	3	3
2123	1	1
2124	224	224
2125	4	4
2126	10	10
2127	453	453
2128	3	3
2129	2	2
2130	1	1
2131	31	31
2132	6	6
2133	2	2
2134	4	4
2135	1	1
2136	2	2
2137	4	4
2138	23	23
2139	4	4
2140	36	36
2141	49	49
2142	1	1
2143	15	15
2144	13	13
2145	2	2
2146	1	1
2147	11	11
2148	23	23
2149	13	13
2150	1	1
2151	92	92
2152	92	92
2153	23	23
2154	6	6
2155	8	8
2156	36	36
2157	96	96
2158	4	4
2159	8	8
2160	8	8
2161	1	1
2162	4	4
2163	1	1
2164	11	11
2165	9	9
2166	5	5
2167	8	8
2168	23	23
2169	26	26
2170	6	6
2171	16	16
2172	2	2
2173	1	1
2174	1	1
2175	1	1
2176	2	2
2177	1	1
2178	1	1
2179	4	4
2180	4	4
2181	1	1
2182	5	5
2183	2	2
2184	1	1
2185	1	1
2186	4	4
2187	1	1
2188	1	1
2189	6	6
2190	1	1
2191	64	64
2192	1	1
2193	2	2
2194	1	1
2195	51	51
2196	1	1
2197	3	3
2198	12	12
2199	1	1
2200	2	2
2201	267	267
2202	2	2
2203	2	2
2204	12	12
2205	4	4
2206	3	3
2207	23	23
2208	1	1
2209	2	2
2210	8	8
2211	2	2
2212	2	2
2213	4	4
2214	1	1
2215	2	2
2216	3	3
2217	2	2
2218	3	3
2219	3	3
2220	2	2
2221	2	2
2222	184	184
2223	3	3
2224	1	1
2225	2	2
2226	3	3
2227	3	3
2228	11	11
2229	12	12
2230	2	2
2231	8	8
2232	2	2
2233	6	6
2234	6	6
2235	2	2
2236	66	66
2237	47	47
2238	36	36
2239	2	2
2240	2	2
2241	2	2
2242	6	6
2243	4	4
2244	1	1
2245	6	6
2246	8	8
2247	2	2
2248	13	13
2249	3	3
2250	1	1
2251	2	2
2252	15	15
2253	1	1
2254	13	13
2255	13	13
2256	29	29
2257	2	2
2258	1	1
2259	2	2
2260	1	1
2261	4	4
2262	2	2
2263	1	1
2264	1	1
2265	27	27
2266	4	4
2267	2	2
2268	10	10
2269	4	4
2270	3	3
2271	1	1
2272	2	2
2273	10	10
2274	16	16
2275	86	86
2276	172	172
2277	2	2
2278	1	1
2279	1	1
2280	3	3
2281	21	21
2282	24	24
2283	4	4
2284	5	5
2285	2	2
2286	4	4
2287	92	92
2288	2	2
2289	3	3
2290	13	13
2291	13	13
2292	1	1
2293	24	24
2294	5	5
2295	1	1
2296	2	2
2297	3	3
2298	93	93
2299	9	9
2300	14	14
2301	3	3
2302	2	2
2303	3	3
2304	1	1
2305	3	3
2306	5	5
2307	1	1
2308	4	4
2309	2	2
2310	4	4
2311	2	2
2312	8	8
2313	3	3
2314	1	1
2315	23	23
2316	2	2
2317	35	35
2318	5	5
2319	29	29
2320	13	13
2321	2	2
2322	6	6
2323	3	3
2324	24	24
2325	3	3
2326	3	3
2327	23	23
2328	10	10
2329	15	15
2330	1	1
2331	1	1
2332	4	4
2333	1	1
2334	3	3
2335	4	4
2336	3	3
2337	1	1
2338	1	1
2339	6	6
2340	6	6
2341	115	115
2342	3	3
2343	13	13
2344	3	3
2345	1	1
2346	3	3
2347	2	2
2348	2	2
2349	1	1
2350	1	1
2351	2	2
2352	23	23
2353	13	13
2354	13	13
2355	4	4
2356	46	46
2357	2	2
2358	23	23
2359	4	4
2360	186	186
2361	2	2
2362	4	4
2363	5	5
2364	23	23
2365	172	172
2366	4	4
2367	1	1
2368	2	2
2369	88	88
2370	86	86
2371	80	80
2372	14	14
2373	2	2
2374	1	1
2375	258	258
2376	2	2
2377	4	4
2378	44	44
2379	2	2
2380	1	1
2381	111	111
2382	15	15
2383	2	2
2384	2	2
2385	15	15
2386	87	87
2387	8	8
2388	23	23
2389	2	2
2390	23	23
2391	6	6
2392	1	1
2393	6	6
2394	2	2
2395	23	23
2396	2	2
2397	6	6
2398	1	1
2399	1	1
2400	1	1
2401	18	18
2402	2	2
2403	8	8
2404	4	4
2405	8	8
2406	23	23
2407	12	12
2408	8	8
2409	6	6
2410	2	2
2411	23	23
2412	4	4
2413	69	69
2414	7	7
2415	2	2
2416	97	97
2417	28	28
2418	14	14
2419	4	4
2420	4	4
2421	13	13
2422	12	12
2423	23	23
2424	7	7
2425	5	5
2426	11	11
2427	2	2
2428	23	23
2429	2	2
2430	1	1
2431	1	1
2432	2	2
2433	4	4
2434	2	2
2435	2	2
2436	1	1
2437	6	6
2438	2	2
2439	2	2
2440	4	4
2441	6	6
2442	13	13
2443	24	24
2444	3	3
2445	2	2
2446	3	3
2447	1	1
2448	2	2
2449	1	1
2450	4	4
2451	27	27
2452	2	2
2453	2	2
2454	1	1
2455	12	12
2456	86	86
2457	2	2
2458	4	4
2459	7	7
2460	9	9
2461	215	215
2462	4	4
2463	4	4
2464	2	2
2465	2	2
2466	13	13
2467	4	4
2468	22	22
2469	1	1
2470	2	2
2471	10	10
2472	3	3
2473	3	3
2474	13	13
2475	13	13
2476	1	1
2477	10	10
2478	1	1
2479	80	80
2480	13	13
2481	2	2
2482	13	13
2483	12	12
2484	1	1
2485	142	142
2486	7	7
2487	14	14
2488	2	2
2489	13	13
2490	4	4
2491	1	1
2492	2	2
2493	2	2
2494	1	1
2495	13	13
2496	4	4
2497	1	1
2498	17	17
2499	2	2
2500	46	46
2501	6	6
2502	87	87
2503	2	2
2504	48	48
2505	598	598
2506	1	1
2507	13	13
2508	3	3
2509	1	1
2510	4	4
2511	15	15
2512	28	28
2513	54	54
2514	2	2
2515	6	6
2516	2	2
2517	44	44
2518	2	2
2519	2	2
2520	23	23
2521	8	8
2522	23	23
2523	2	2
2524	2	2
2525	1	1
2526	2	2
2527	4	4
2528	8	8
2529	19	19
2530	36	36
2531	6	6
2532	3	3
2533	32	32
2534	190	190
2535	7	7
2536	12	12
2537	6	6
2538	5	5
2539	59	59
2540	174	174
2541	2	2
2542	101	101
2543	1	1
2544	1	1
2545	18	18
2546	3	3
2547	95	95
2548	2	2
2549	72	72
2550	18	18
2551	18	18
2552	5	5
2553	171	171
2554	3	3
2555	1	1
2556	1	1
2557	4	4
2558	11	11
2559	1	1
2560	15	15
2561	10	10
2562	6	6
2563	289	289
2564	1	1
2565	11	11
2566	23	23
2567	1	1
2568	6	6
2569	17	17
2570	15	15
2571	1	1
2572	3	3
2573	9	9
2574	59	59
2575	132	132
2576	16	16
2577	2	2
2578	25	25
2579	75	75
2580	17	17
2581	62	62
2582	23	23
2583	8	8
2584	47	47
2585	3	3
2586	81	81
2587	51	51
2588	6	6
2589	23	23
2590	13	13
2591	2	2
2592	5	5
2593	31	31
2594	19	19
2595	13	13
2596	26	26
2597	1	1
2598	1	1
2599	13	13
2600	13	13
2601	18	18
2602	8	8
2603	8	8
2604	2	2
2605	16	16
2606	1	1
2607	2	2
2608	311	311
2609	2	2
2610	3	3
2611	18	18
2612	1	1
2613	26	26
2614	36	36
2615	2	2
2616	1	1
2617	44	44
2618	9	9
2619	19	19
2620	69	69
2621	19	19
2622	1	1
2623	2	2
2624	1	1
2625	1	1
2626	14	14
2627	3	3
2628	1	1
2629	6	6
2630	3	3
2631	46	46
2632	5	5
2633	6	6
2634	13	13
2635	8	8
2636	4	4
2637	1	1
2638	1	1
2639	1	1
2640	13	13
2641	23	23
2642	1	1
2643	23	23
2644	3	3
2645	14	14
2646	2	2
2647	2	2
2648	2	2
2649	2	2
2650	18	18
2651	13	13
2652	2	2
2653	2	2
2654	26	26
2655	59	59
2656	1	1
2657	1	1
2658	4	4
2659	2	2
2660	14	14
2661	191	191
2662	1	1
2663	5	5
2664	3	3
2665	7	7
2666	3	3
2667	654	654
2668	36	36
2669	5	5
2670	1	1
2671	2	2
2672	2	2
2673	13	13
2674	4	4
2675	1	1
2676	2	2
2677	3	3
2678	2	2
2679	671	671
2680	6	6
2681	2	2
2682	1	1
2683	4	4
2684	10	10
2685	4	4
2686	23	23
2687	1	1
2688	17	17
2689	33	33
2690	1	1
2691	2	2
2692	13	13
2693	23	23
2694	25	25
2695	2	2
2696	1	1
2697	1	1
2698	5	5
2699	26	26
2700	45	45
2701	2	2
2702	13	13
2703	13	13
2704	13	13
2705	2	2
2706	56	56
2707	152	152
2708	140	140
2709	71	71
2710	11	11
2711	4	4
2712	28	28
2713	6	6
2714	2101	2101
2715	17	17
2716	150	150
2717	415	415
2718	3	3
2719	5	5
2720	35	35
2721	29	29
2722	2	2
2723	10	10
2724	4	4
2725	70	70
2726	1	1
2727	5	5
2728	10	10
2729	5	5
2730	54	54
2731	10	10
2732	115	115
2733	10	10
2734	23	23
2735	2	2
2736	93	93
2737	1	1
2738	11	11
2739	11	11
2740	1	1
2741	1	1
2742	27	27
2743	2	2
2744	2	2
2745	5	5
2746	12	12
2747	2	2
2748	29	29
2749	23	23
2750	3	3
2751	2	2
2752	2	2
2753	242	242
2754	1	1
2755	12	12
2756	25	25
2757	26	26
2758	23	23
2759	18	18
2760	195	195
2761	3	3
2762	49	49
2763	8	8
2764	2	2
2765	2	2
2766	1	1
2767	53	53
2768	46	46
2769	1	1
2770	1	1
2771	26	26
2772	11	11
2773	1	1
2774	1	1
2775	5	5
2776	2	2
2777	2	2
2778	4	4
2779	4	4
2780	8	8
2781	4	4
2782	4	4
2783	2	2
2784	2	2
2785	2	2
2786	26	26
2787	42	42
2788	4	4
2789	4	4
2790	371	371
2791	13	13
2792	749	749
2793	3	3
2794	299	299
2795	13	13
2796	36	36
2797	39	39
2798	26	26
2799	24	24
2800	72	72
2801	1	1
2802	36	36
2803	13	13
2804	16	16
2805	46	46
2806	45	45
2807	6	6
2808	23	23
2809	81	81
2810	23	23
2811	1	1
2812	6	6
2813	5	5
2814	1	1
2815	3	3
2816	13	13
2817	3	3
2818	217	217
2819	16	16
2820	8	8
2821	92	92
2822	26	26
2823	5	5
2824	2	2
2825	4	4
2826	2	2
2827	2	2
2828	1	1
2829	6	6
2830	12	12
2831	3	3
2832	72	72
2833	236	236
2834	3	3
2835	20	20
2836	2	2
2837	6	6
2838	21	21
2839	4	4
2840	13	13
2841	128	128
2842	1	1
2843	13	13
2844	5	5
2845	4	4
2846	3	3
2847	44	44
2848	16	16
2849	12	12
2850	45	45
2851	2	2
2852	3	3
2853	14	14
2854	26	26
2855	23	23
2856	89	89
2857	437	437
2858	115	115
2859	46	46
2860	13	13
2861	8	8
2862	3	3
2863	1	1
2864	11	11
2865	4	4
2866	39	39
2867	2	2
2868	13	13
2869	36	36
2870	2	2
2871	2	2
2872	7	7
2873	1	1
2874	8	8
2875	2	2
2876	2	2
2877	37	37
2878	1	1
2879	1	1
2880	23	23
2881	2	2
2882	13	13
2883	23	23
2884	6	6
2885	3	3
2886	1	1
2887	24	24
2888	30	30
2889	161	161
2890	13	13
2891	117	117
2892	3	3
2893	59	59
2894	26	26
2895	3	3
2896	1	1
2897	36	36
2898	12	12
2899	13	13
2900	15	15
2901	1	1
2902	23	23
2903	18	18
2904	1	1
2905	2	2
2906	2	2
2907	217	217
2908	23	23
2909	3	3
2910	4	4
2911	4	4
2912	69	69
2913	23	23
2914	36	36
2915	2	2
2916	13	13
2917	36	36
2918	72	72
2919	2	2
2920	36	36
2921	1	1
2922	2	2
2923	3	3
2924	2	2
2925	6	6
2926	23	23
2927	1	1
2928	13	13
2929	4	4
2930	2	2
2931	1	1
2932	3	3
2933	6	6
2934	28	28
2935	3	3
2936	23	23
2937	4	4
2938	4	4
2939	23	23
2940	36	36
2941	22	22
2942	1	1
2943	13	13
2944	1	1
2945	42	42
2946	1	1
2947	10	10
2948	39	39
2949	69	69
2950	1	1
2951	12	12
2952	3	3
2953	58	58
2954	54	54
2955	5	5
2956	3	3
2957	39	39
2958	1	1
2959	5	5
2960	46	46
2961	107	107
2962	26	26
2963	96	96
2964	24	24
2965	2	2
2966	2	2
2967	36	36
2968	9	9
2969	1	1
2970	22	22
2971	1	1
2972	70	70
2973	10	10
2974	26	26
2975	13	13
2976	46	46
2977	23	23
2978	36	36
2979	8	8
2980	10	10
2981	158	158
2982	60	60
2983	15	15
2984	2	2
2985	13	13
2986	12	12
2987	23	23
2988	1	1
2989	23	23
2990	91	91
2991	2	2
2992	72	72
2993	234	234
2994	30	30
2995	23	23
2996	11	11
2997	13	13
2998	5	5
2999	3	3
3000	23	23
3001	1	1
3002	3	3
3003	14	14
3004	26	26
3005	46	46
3006	9	9
3007	6	6
3008	6	6
3009	14	14
3010	10	10
3011	2	2
3012	2	2
3013	4	4
3014	2	2
3015	15	15
3016	10	10
3017	23	23
3018	40	40
3019	20	20
3020	2	2
3021	2	2
3022	10	10
3023	4	4
3024	2	2
3025	36	36
3026	4	4
3027	1	1
3028	2	2
3029	4	4
3030	3	3
3031	2	2
3032	4	4
3033	4	4
3034	12	12
3035	11	11
3036	8	8
3037	3	3
3038	2	2
3039	1	1
3040	7	7
3041	14	14
3042	9	9
3043	11	11
3044	4	4
3045	2	2
3046	1	1
3047	215	215
3048	11	11
3049	1	1
3050	9	9
3051	10	10
3052	2	2
3053	4	4
3054	3	3
3055	7	7
3056	1	1
3057	1	1
3058	10	10
3059	4	4
3060	22	22
3061	2	2
3062	3	3
3063	1	1
3064	3	3
3065	66	66
3066	2	2
3067	9	9
3068	26	26
3069	2	2
3070	23	23
3071	1	1
3072	2	2
3073	3	3
3074	18	18
3075	7	7
3076	39	39
3077	69	69
3078	3	3
3079	4	4
3080	39	39
3081	69	69
3082	5	5
3083	5	5
3084	10	10
3085	40	40
3086	7	7
3087	46	46
3088	17	17
3089	18	18
3090	4	4
3091	1	1
3092	2	2
3093	14	14
3094	11	11
3095	23	23
3096	6	6
3097	4	4
3098	9	9
3099	1	1
3100	2	2
3101	2	2
3102	15	15
3103	4	4
3104	23	23
3105	13	13
3106	13	13
3107	2	2
3108	2	2
3109	3	3
3110	2	2
3111	2	2
3112	1	1
3113	6	6
3114	1	1
3115	4	4
3116	15	15
3117	2	2
3118	6	6
3119	12	12
3120	3	3
3121	1	1
3122	2	2
3123	3	3
3124	14	14
3125	13	13
3126	6	6
3127	25	25
3128	23	23
3129	10	10
3130	4	4
3131	1	1
3132	1	1
3133	13	13
3134	45	45
3135	2	2
3136	9	9
3137	4	4
3138	92	92
3139	4	4
3140	2	2
3141	9	9
3142	15	15
3143	23	23
3144	5	5
3145	2	2
3146	91	91
3147	6	6
3148	36	36
3149	4	4
3150	13	13
3151	1	1
3152	1	1
3153	4	4
3154	1	1
3155	1	1
3156	6	6
3157	2	2
3158	2	2
3159	28	28
3160	2	2
3161	1	1
3162	66	66
3163	8	8
3164	2	2
3165	9	9
3166	46	46
3167	92	92
3168	24	24
3169	2	2
3170	2	2
3171	1	1
3172	2	2
3173	18	18
3174	3	3
3175	1	1
3176	3	3
3177	3	3
3178	3	3
3179	3	3
3180	2	2
3181	1	1
3182	1	1
3183	1	1
3184	9	9
3185	2	2
3186	3	3
3187	26	26
3188	4	4
3189	2	2
3190	27	27
3191	3	3
3192	46	46
3193	296	296
3194	1	1
3195	36	36
3196	4	4
3197	4	4
3198	1	1
3199	3	3
3200	6	6
3201	228	228
3202	900	900
3203	5	5
3204	1	1
3205	4	4
3206	1	1
3207	17	17
3208	4	4
3209	13	13
3210	9	9
3211	3	3
3212	9	9
3213	1	1
3214	1	1
3215	1	1
3216	23	23
3217	39	39
3218	213	213
3219	3	3
3220	1	1
3221	2	2
3222	1	1
3223	69	69
3224	2	2
3225	15	15
3226	1	1
3227	1	1
3228	2	2
3229	2	2
3230	2	2
3231	2	2
3232	2	2
3233	2	2
3234	23	23
3235	2	2
3236	14	14
3237	24	24
3238	46	46
3239	2	2
3240	3	3
3241	3	3
3242	1	1
3243	1	1
3244	6	6
3245	7	7
3246	4	4
3247	48	48
3248	1	1
3249	25	25
3250	33	33
3251	21	21
3252	46	46
3253	23	23
3254	13	13
3255	1	1
3256	1	1
3257	46	46
3258	1	1
3259	27	27
3260	440	440
3261	3	3
3262	15	15
3263	12	12
3264	2	2
3265	6	6
3266	3	3
3267	1	1
3268	1	1
3269	11	11
3270	4	4
3271	1	1
3272	6	6
3273	48	48
3274	6	6
3275	6	6
3276	5	5
3277	4	4
3278	184	184
3279	5	5
3280	150	150
3281	11	11
3282	53	53
3283	1	1
3284	1	1
3285	4	4
3286	8	8
3287	1	1
3288	7	7
3289	35	35
3290	65	65
3291	46	46
3292	96	96
3293	30	30
3294	5	5
3295	2	2
3296	14	14
3297	1	1
3298	1	1
3299	16	16
3300	12	12
3301	36	36
3302	1	1
3303	5	5
3304	2	2
3305	23	23
3306	46	46
3307	11	11
3308	1	1
3309	213	213
3310	213	213
3311	8	8
3312	151	151
3313	6	6
3314	1	1
3315	6	6
3316	3	3
3317	26	26
3318	26	26
3319	13	13
3320	3	3
3321	1	1
3322	1	1
3323	23	23
3324	213	213
3325	1	1
3326	4	4
3327	1	1
3328	1	1
3329	4	4
3330	13	13
3331	1	1
3332	5	5
3333	3	3
3334	7	7
3335	4	4
3336	1	1
3337	1	1
3338	2	2
3339	36	36
3340	1	1
3341	18	18
3342	59	59
3343	1	1
3344	3	3
3345	36	36
3346	10	10
3347	4	4
3348	3	3
3349	6	6
3350	4	4
3351	3	3
3352	13	13
3353	3	3
3354	4	4
3355	4	4
3356	6	6
3357	2	2
3358	27	27
3359	126	126
3360	8	8
3361	19	19
3362	1	1
3363	13	13
3364	59	59
3365	20	20
3366	27	27
3367	4	4
3368	39	39
3369	25	25
3370	50	50
3371	6	6
3372	2	2
3373	48	48
3374	4	4
3375	3	3
3376	1	1
3377	13	13
3378	13	13
3379	2	2
3380	13	13
3381	1	1
3382	1	1
3383	1	1
3384	2	2
3385	4	4
3386	4	4
3387	4	4
3388	2	2
3389	5	5
3390	6	6
3391	3	3
3392	1	1
3393	3	3
3394	5	5
3395	3	3
3396	3	3
3397	5	5
3398	1	1
3399	1	1
3400	1	1
3401	1	1
3402	46	46
3403	6	6
3404	4	4
3405	4	4
3406	3	3
3407	18	18
3408	1	1
3409	3	3
3410	6	6
3411	4	4
3412	2	2
3413	6	6
3414	2	2
3415	1	1
3416	8	8
3417	8	8
3418	2	2
3419	13	13
3420	4	4
3421	1	1
3422	1	1
3423	23	23
3424	4	4
3425	5	5
3426	1	1
3427	1	1
3428	1	1
3429	1	1
3430	2	2
3431	863	863
3432	74	74
3433	2	2
3434	6	6
3435	2	2
3436	7	7
3437	1	1
3438	2	2
3439	143	143
3440	3	3
3441	1	1
3442	9	9
3443	23	23
3444	2	2
3445	2	2
3446	2	2
3447	8	8
3448	267	267
3449	2	2
3450	3	3
3451	2	2
3452	6	6
3453	6	6
3454	23	23
3455	6	6
3456	1	1
3457	206	206
3458	10	10
3459	2	2
3460	1	1
3461	23	23
3462	4	4
3463	15	15
3464	25	25
3465	23	23
3466	24	24
3467	230	230
3468	30	30
3469	60	60
3470	13	13
3471	23	23
3472	15	15
3473	2	2
3474	2	2
3475	2	2
3476	4	4
3477	4	4
3478	12	12
3479	4	4
3480	1	1
3481	5	5
3482	22	22
3483	2	2
3484	12	12
3485	4	4
3486	5	5
3487	4	4
3488	34	34
3489	23	23
3490	13	13
3491	18	18
3492	447	447
3493	84	84
3494	23	23
3495	53	53
3496	27	27
3497	4	4
3498	1	1
3499	232	232
3500	6	6
3501	5	5
3502	18	18
3503	11	11
3504	23	23
3505	10	10
3506	6	6
3507	2	2
3508	6	6
3509	25	25
3510	6	6
3511	73	73
3512	46	46
3513	2	2
3514	138	138
3515	3	3
3516	10	10
3517	10	10
3518	34	34
3519	24	24
3520	1	1
3521	4	4
3522	19	19
3523	58	58
3524	10	10
3525	2	2
3526	25	25
3527	23	23
3528	15	15
3529	2	2
3530	3	3
3531	37	37
3532	23	23
3533	333	333
3534	2	2
3535	20	20
3536	5	5
3537	11	11
3538	9	9
3539	43	43
3540	5	5
3541	2	2
3542	1	1
3543	4	4
3544	10	10
3545	12	12
3546	4	4
3547	15	15
3548	6	6
3549	12	12
3550	2	2
3551	6	6
3552	10	10
3553	1	1
3554	60	60
3555	2	2
3556	42	42
3557	1	1
3558	5	5
3559	23	23
3560	13	13
3561	169	169
3562	1	1
3563	25	25
3564	5	5
3565	26	26
3566	2	2
3567	36	36
3568	11	11
3569	184	184
3570	2	2
3571	4	4
3572	46	46
3573	6	6
3574	5	5
3575	6	6
3576	6	6
3577	4	4
3578	4	4
3579	10	10
3580	1	1
3581	18	18
3582	1	1
3583	1	1
3584	13	13
3585	2	2
3586	4	4
3587	2	2
3588	5	5
3589	3	3
3590	2	2
3591	13	13
3592	4	4
3593	8	8
3594	2	2
3595	2	2
3596	26	26
3597	11	11
3598	2	2
3599	1	1
3600	36	36
3601	16	16
3602	10	10
3603	2	2
3604	2	2
3605	2	2
3606	6	6
3607	32	32
3608	8	8
3609	12	12
3610	1	1
3611	2	2
3612	13	13
3613	2	2
3614	5	5
3615	1	1
3616	2	2
3617	13	13
3618	46	46
3619	69	69
3620	3	3
3621	3	3
3622	2	2
3623	23	23
3624	2	2
3625	13	13
3626	1	1
3627	1	1
3628	3	3
3629	213	213
3630	213	213
3631	213	213
3632	213	213
3633	213	213
3634	39	39
3635	13	13
3636	22	22
3637	4	4
3638	13	13
3639	17	17
3640	6	6
3641	4	4
3642	5	5
3643	2	2
3644	1	1
3645	5	5
3646	17	17
3647	1	1
3648	1	1
3649	13	13
3650	2	2
3651	1	1
3652	2	2
3653	11	11
3654	26	26
3655	2	2
3656	1	1
3657	104	104
3658	52	52
3659	1	1
3660	2	2
3661	1	1
3662	52	52
3663	10	10
3664	36	36
3665	3	3
3666	36	36
3667	1	1
3668	36	36
3669	46	46
3670	26	26
3671	2	2
3672	6	6
3673	6	6
3674	4	4
3675	5	5
3676	30	30
3677	1	1
3678	8	8
3679	27	27
3680	1	1
3681	13	13
3682	2	2
3683	2	2
3684	13	13
3685	1	1
3686	1	1
3687	2	2
3688	13	13
3689	12	12
3690	3	3
3691	4	4
3692	4	4
3693	4	4
3694	8	8
3695	2	2
3696	1	1
3697	1	1
3698	1	1
3699	36	36
3700	2	2
3701	5	5
3702	6	6
3703	106	106
3704	13	13
3705	14	14
3706	1	1
3707	36	36
3708	3	3
3709	4	4
3710	18	18
3711	3	3
3712	23	23
3713	2	2
3714	23	23
3715	92	92
3716	4	4
3717	26	26
3718	1	1
3719	1	1
3720	1	1
3721	2	2
3722	50	50
3723	13	13
3724	56	56
3725	3	3
3726	1	1
3727	2	2
3728	2	2
3729	2	2
3730	20	20
3731	34	34
3732	2	2
3733	1	1
3734	1	1
3735	2	2
3736	35	35
3737	1	1
3738	20	20
3739	10	10
3740	2	2
3741	12	12
3742	2	2
3743	20	20
3744	13	13
3745	10	10
3746	130	130
3747	333	333
3748	6	6
3749	13	13
3750	14	14
3751	186	186
3752	51	51
3753	5	5
3754	54	54
3755	8	8
3756	27	27
3757	35	35
3758	23	23
3759	18	18
3760	2	2
3761	11	11
3762	2	2
3763	36	36
3764	8	8
3765	3	3
3766	3	3
3767	1	1
3768	1	1
3769	2	2
3770	8	8
3771	1	1
3772	2	2
3773	9	9
3774	5	5
3775	10	10
3776	1	1
3777	9	9
3778	1	1
3779	2	2
3780	3	3
3781	23	23
3782	5	5
3783	7	7
3784	2	2
3785	26	26
3786	10	10
3787	1	1
3788	1	1
3789	4	4
3790	37	37
3791	8	8
3792	17	17
3793	60	60
3794	255	255
3795	94	94
3796	6	6
3797	25	25
3798	3	3
3799	79	79
3800	8	8
3801	44	44
3802	6	6
3803	1	1
3804	220	220
3805	3	3
3806	2	2
3807	8	8
3808	521	521
3809	1	1
3810	74	74
3811	10	10
3812	594	594
3813	65	65
3814	2	2
3815	130	130
3816	70	70
3817	4	4
3818	12	12
3819	41	41
3820	6	6
3821	1	1
3822	6	6
3823	3	3
3824	2	2
3825	41	41
3826	2	2
3827	76	76
3828	6	6
3829	2	2
3830	28	28
3831	14	14
3832	8	8
3833	2	2
3834	1	1
3835	16	16
3836	65	65
3837	26	26
3838	26	26
3839	9	9
3840	2	2
3841	69	69
3842	1	1
3843	4	4
3844	13	13
3845	2	2
3846	3	3
3847	13	13
3848	8	8
3849	4	4
3850	2	2
3851	13	13
3852	13	13
3853	29	29
3854	1	1
3855	2	2
3856	2	2
3857	29	29
3858	13	13
3859	5	5
3860	2	2
3861	15	15
3862	27	27
3863	12	12
3864	17	17
3865	20	20
3866	4	4
3867	1	1
3868	2	2
3869	6	6
3870	5	5
3871	3	3
3872	1	1
3873	3	3
3874	1	1
3875	36	36
3876	2	2
3877	2	2
3878	2	2
3879	5	5
3880	12	12
3881	6	6
3882	72	72
3883	2	2
3884	12	12
3885	1	1
3886	26	26
3887	2	2
3888	5	5
3889	23	23
3890	1	1
3891	44	44
3892	85	85
3893	46	46
3894	2	2
3895	23	23
3896	3	3
3897	8	8
3898	2	2
3899	1	1
3900	1	1
3901	56	56
3902	2	2
3903	35	35
3904	13	13
3905	1	1
3906	3	3
3907	44	44
3908	1	1
3909	2	2
3910	2	2
3911	36	36
3912	1	1
3913	9	9
3914	2	2
3915	36	36
3916	1	1
3917	13	13
3918	11	11
3919	36	36
3920	12	12
3921	7	7
3922	4	4
3923	1	1
3924	4	4
3925	23	23
3926	2	2
3927	26	26
3928	17	17
3929	1	1
3930	14	14
3931	4	4
3932	39	39
3933	26	26
3934	13	13
3935	2	2
3936	5	5
3937	4	4
3938	1	1
3939	2	2
3940	13	13
3941	13	13
3942	36	36
3943	23	23
3944	4	4
3945	13	13
3946	8	8
3947	2	2
3948	25	25
3949	3	3
3950	1	1
3951	2	2
3952	3	3
3953	13	13
3954	36	36
3955	4	4
3956	82	82
3957	13	13
3958	2	2
3959	1	1
3960	9	9
3961	5	5
3962	6	6
3963	1	1
3964	1	1
3965	1	1
3966	1	1
3967	1	1
3968	1	1
3969	2	2
3970	6	6
3971	4	4
3972	3	3
3973	1	1
3974	5	5
3975	1	1
3976	5	5
3977	8	8
3978	2	2
3979	3	3
3980	18	18
3981	1	1
3982	1	1
3983	12	12
3984	1	1
3985	46	46
3986	3	3
3987	2	2
3988	23	23
3989	4	4
3990	3	3
3991	2	2
3992	12	12
3993	3	3
3994	2	2
3995	2	2
3996	2	2
3997	6	6
3998	3	3
3999	2	2
4000	3	3
4001	5	5
4002	2	2
4003	6	6
4004	8	8
4005	6	6
4006	1	1
4007	1	1
4008	2	2
4009	3	3
4010	4	4
4011	2	2
4012	2	2
4013	6	6
4014	6	6
4015	2	2
4016	1	1
4017	1	1
4018	6	6
4019	1	1
4020	1	1
4021	2	2
4022	1	1
4023	1	1
4024	2	2
4025	1	1
4026	2	2
4027	1	1
4028	25	25
4029	4	4
4030	2	2
4031	4	4
4032	13	13
4033	2	2
4034	1	1
4035	1	1
4036	12	12
4037	36	36
4038	4	4
4039	12	12
4040	2	2
4041	1	1
4042	6	6
4043	3	3
4044	2	2
4045	12	12
4046	11	11
4047	13	13
4048	2	2
4049	102	102
4050	23	23
4051	5	5
4052	6	6
4053	2	2
4054	1	1
4055	1	1
4056	3	3
4057	53	53
4058	6	6
4059	4	4
4060	1	1
4061	2	2
4062	8	8
4063	12	12
4064	2	2
4065	5	5
4066	4	4
4067	23	23
4068	23	23
4069	25	25
4070	4	4
4071	4	4
4072	2	2
4073	2	2
4074	49	49
4075	23	23
4076	3	3
4077	3	3
4078	4	4
4079	5	5
4080	46	46
4081	46	46
4082	18	18
4083	4	4
4084	82	82
4085	23	23
4086	2	2
4087	1	1
4088	7	7
4089	19	19
4090	4	4
4091	4	4
4092	2	2
4093	3	3
4094	1	1
4095	1	1
4096	2	2
4097	59	59
4098	10	10
4099	2	2
4100	74	74
4101	7	7
4102	3	3
4103	2	2
4104	2	2
4105	3	3
4106	2	2
4107	30	30
4108	94	94
4109	9	9
4110	4	4
4111	2	2
4112	15	15
4113	2	2
4114	6	6
4115	13	13
4116	13	13
4117	73	73
4118	36	36
4119	13	13
4120	2	2
4121	3	3
4122	26	26
4123	5	5
4124	2	2
4125	4	4
4126	21	21
4127	2	2
4128	2	2
4129	2	2
4130	4	4
4131	1	1
4132	2	2
4133	3	3
4134	13	13
4135	2	2
4136	2	2
4137	2	2
4138	19	19
4139	13	13
4140	4	4
4141	2	2
4142	2	2
4143	22	22
4144	12	12
4145	1	1
4146	6	6
4147	3	3
4148	12	12
4149	111	111
4150	12	12
4151	1	1
4152	13	13
4153	1	1
4154	1	1
4155	2	2
4156	10	10
4157	2	2
4158	2	2
4159	23	23
4160	4	4
4161	2	2
4162	5	5
4163	2	2
4164	1	1
4165	1	1
4166	69	69
4167	1	1
4168	16	16
4169	2	2
4170	4	4
4171	98	98
4172	1	1
4173	3	3
4174	6	6
4175	2	2
4176	1	1
4177	4	4
4178	8	8
4179	8	8
4180	1	1
4181	4	4
4182	6	6
4183	3	3
4184	3	3
4185	3	3
4186	2	2
4187	1	1
4188	2	2
4189	13	13
4190	1	1
4191	1	1
4192	13	13
4193	23	23
4194	36	36
4195	5	5
4196	169	169
4197	6	6
4198	1	1
4199	10	10
4200	16	16
4201	13	13
4202	1	1
4203	23	23
4204	1	1
4205	26	26
4206	1	1
4207	13	13
4208	36	36
4209	1	1
4210	1	1
4211	2	2
4212	2	2
4213	2	2
4214	1	1
4215	11	11
4216	2	2
4217	5	5
4218	4	4
4219	4	4
4220	2	2
4221	1	1
4222	36	36
4223	13	13
4224	10	10
4225	13	13
4226	4	4
4227	65	65
4228	197	197
4229	3	3
4230	39	39
4231	2	2
4232	59	59
4233	36	36
4234	131	131
4235	108	108
4236	368	368
4237	65	65
4238	177	177
4239	36	36
4240	13	13
4241	43	43
4242	9	9
4243	3	3
4244	4	4
4245	2	2
4246	26	26
4247	8	8
4248	2	2
4249	4	4
4250	4	4
4251	8	8
4252	2	2
4253	2	2
4254	2	2
4255	2	2
4256	9	9
4257	2	2
4258	6	6
4259	2	2
4260	2	2
4261	1	1
4262	17	17
4263	4	4
4264	4	4
4265	6	6
4266	4	4
4267	4	4
4268	27	27
4269	4	4
4270	46	46
4271	26	26
4272	69	69
4273	52	52
4274	17	17
4275	13	13
4276	25	25
4277	2	2
4278	3	3
4279	4	4
4280	18	18
4281	2	2
4282	4	4
4283	2	2
4284	13	13
4285	98	98
4286	2	2
4287	4	4
4288	23	23
4289	23	23
4290	12	12
4291	12	12
4292	6	6
4293	2	2
4294	2	2
4295	38	38
4296	2	2
4297	2	2
4298	36	36
4299	1	1
4300	14	14
4301	1	1
4302	1	1
4303	1	1
4304	2	2
4305	6	6
4306	4	4
4307	2	2
4308	2	2
4309	4	4
4310	4	4
4311	12	12
4312	10	10
4313	3	3
4314	2	2
4315	1	1
4316	23	23
4317	7	7
4318	6	6
4319	10	10
4320	1	1
4321	7	7
4322	4	4
4323	37	37
4324	2	2
4325	20	20
4326	26	26
4327	10	10
4328	39	39
4329	2	2
4330	13	13
4331	2	2
4332	13	13
4333	4	4
4334	34	34
4335	6	6
4336	9	9
4337	2	2
4338	1	1
4339	1	1
4340	9	9
4341	23	23
4342	28	28
4343	8	8
4344	3	3
4345	46	46
4346	6	6
4347	26	26
4348	4	4
4349	6	6
4350	8	8
4351	24	24
4352	2	2
4353	13	13
4354	2	2
4355	26	26
4356	13	13
4357	1	1
4358	9	9
4359	2	2
4360	69	69
4361	5	5
4362	2	2
4363	13	13
4364	11	11
4365	12	12
4366	2	2
4367	10	10
4368	1	1
4369	1	1
4370	1	1
4371	57	57
4372	49	49
4373	11	11
4374	2	2
4375	4	4
4376	129	129
4377	4	4
4378	1	1
4379	2	2
4380	85	85
4381	12	12
4382	23	23
4383	2	2
4384	6	6
4385	23	23
4386	6	6
4387	12	12
4388	13	13
4389	2	2
4390	2	2
4391	1	1
4392	9	9
4393	4	4
4394	81	81
4395	1	1
4396	2	2
4397	10	10
4398	2	2
4399	2	2
4400	2	2
4401	10	10
4402	1	1
4403	2	2
4404	6	6
4405	4	4
4406	52	52
4407	13	13
4408	13	13
4409	23	23
4410	23	23
4411	13	13
4412	1	1
4413	5	5
4414	1	1
4415	2	2
4416	2	2
4417	1	1
4418	29	29
4419	13	13
4420	2	2
4421	13	13
4422	27	27
4423	13	13
4424	23	23
4425	9	9
4426	69	69
4427	46	46
4428	10	10
4429	105	105
4430	2	2
4431	36	36
4432	2	2
4433	5	5
4434	1	1
4435	54	54
4436	100	100
4437	46	46
4438	13	13
4439	4	4
4440	2	2
4441	4	4
4442	36	36
4443	2	2
4444	2	2
4445	24	24
4446	23	23
4447	4	4
4448	13	13
4449	5	5
4450	1	1
4451	25	25
4452	41	41
4453	13	13
4454	2	2
4455	12	12
4456	1	1
4457	17	17
4458	1	1
4459	35	35
4460	2	2
4461	40	40
4462	4	4
4463	2	2
4464	22	22
4465	25	25
4466	1	1
4467	2	2
4468	4	4
4469	2	2
4470	3	3
4471	4	4
4472	13	13
4473	49	49
4474	23	23
4475	2	2
4476	249	249
4477	10	10
4478	4	4
4479	4	4
4480	82	82
4481	12	12
4482	2	2
4483	2	2
4484	32	32
4485	373	373
4486	4	4
4487	2	2
4488	6	6
4489	4	4
4490	2	2
4491	143	143
4492	1	1
4493	2	2
4494	72	72
4495	77	77
4496	2	2
4497	4	4
4498	13	13
4499	23	23
4500	23	23
4501	2	2
4502	1	1
4503	26	26
4504	1	1
4505	4	4
4506	4	4
4507	2	2
4508	2	2
4509	5	5
4510	3	3
4511	29	29
4512	42	42
4513	13	13
4514	12	12
4515	2	2
4516	8	8
4517	2	2
4518	2	2
4519	10	10
4520	47	47
4521	14	14
4522	23	23
4523	16	16
4524	23	23
4525	8	8
4526	69	69
4527	4	4
4528	5	5
4529	4	4
4530	2	2
4531	1	1
4532	1	1
4533	1	1
4534	23	23
4535	43	43
4536	23	23
4537	2	2
4538	2	2
4539	2	2
4540	6	6
4541	5	5
4542	1	1
4543	23	23
4544	1	1
4545	58	58
4546	13	13
4547	6	6
4548	1	1
4549	6	6
4550	1	1
4551	5	5
4552	3	3
4553	9	9
4554	3	3
4555	5	5
4556	1	1
4557	1	1
4558	22	22
4559	2	2
4560	1	1
4561	1	1
4562	2	2
4563	414	414
4564	2	2
4565	588	588
4566	2	2
4567	1	1
4568	108	108
4569	730	730
4570	78	78
4571	2	2
4572	4	4
4573	3	3
4574	2	2
4575	4	4
4576	2	2
4577	1	1
4578	46	46
4579	23	23
4580	36	36
4581	13	13
4582	1	1
4583	2	2
4584	2	2
4585	2	2
4586	36	36
4587	5	5
4588	5	5
4589	13	13
4590	2	2
4591	9	9
4592	9	9
4593	36	36
4594	23	23
4595	4	4
4596	9	9
4597	27	27
4598	69	69
4599	2	2
4600	14	14
4601	145	145
4602	2	2
4603	1	1
4604	115	115
4605	16	16
4606	1	1
4607	6	6
4608	23	23
4609	22	22
4610	2	2
4611	2	2
4612	22	22
4613	2	2
4614	2	2
4615	23	23
4616	2	2
4617	23	23
4618	9	9
4619	51	51
4620	11	11
4621	14	14
4622	9	9
4623	2	2
4624	2	2
4625	15	15
4626	1	1
4627	2	2
4628	1	1
4629	2	2
4630	2	2
4631	2	2
4632	2	2
4633	23	23
4634	105	105
4635	124	124
4636	3	3
4637	13	13
4638	2	2
4639	1	1
4640	23	23
4641	7	7
4642	2	2
4643	13	13
4644	1	1
4645	9	9
4646	13	13
4647	19	19
4648	23	23
4649	1	1
4650	23	23
4651	1	1
4652	1	1
4653	23	23
4654	23	23
4655	26	26
4656	49	49
4657	13	13
4658	2	2
4659	2	2
4660	46	46
4661	2	2
4662	2	2
4663	2	2
4664	6	6
4665	13	13
4666	6	6
4667	84	84
4668	13	13
4669	36	36
4670	10	10
4671	5	5
4672	36	36
4673	2	2
4674	2	2
4675	13	13
4676	46	46
4677	13	13
4678	23	23
4679	2	2
4680	23	23
4681	26	26
4682	1	1
4683	6	6
4684	1	1
4685	23	23
4686	9	9
4687	2	2
4688	36	36
4689	9	9
4690	18	18
4691	4	4
4692	5	5
4693	5	5
4694	15	15
4695	1	1
4696	2	2
4697	13	13
4698	2	2
4699	2	2
4700	1	1
4701	1	1
4702	2	2
4703	23	23
4704	1	1
4705	3	3
4706	2	2
4707	1	1
4708	1	1
4709	9	9
4710	14	14
4711	4	4
4712	2	2
4713	13	13
4714	13	13
4715	8	8
4716	2	2
4717	23	23
4718	4	4
4719	18	18
4720	9	9
4721	18	18
4722	4	4
4723	14	14
4724	2	2
4725	2	2
4726	7	7
4727	1	1
4728	66	66
4729	2	2
4730	23	23
4731	2	2
4732	3	3
4733	2	2
4734	3	3
4735	1	1
4736	4	4
4737	6	6
4738	4	4
4739	2	2
4740	4	4
4741	2	2
4742	13	13
4743	1	1
4744	1	1
4745	2	2
4746	4	4
4747	8	8
4748	2	2
4749	6	6
4750	8	8
4751	23	23
4752	2	2
4753	1	1
4754	36	36
4755	49	49
4756	26	26
4757	4	4
4758	13	13
4759	2	2
4760	4	4
4761	4	4
4762	2	2
4763	4	4
4764	2	2
4765	23	23
4766	2	2
4767	46	46
4768	23	23
4769	13	13
4770	23	23
4771	5	5
4772	6	6
4773	14	14
4774	23	23
4775	13	13
4776	13	13
4777	2	2
4778	2	2
4779	1	1
4780	30	30
4781	40	40
4782	2	2
4783	1	1
4784	2	2
4785	10	10
4786	20	20
4787	10	10
4788	14	14
4789	1	1
4790	2	2
4791	210	210
4792	50	50
4793	32	32
4794	40	40
4795	26	26
4796	10	10
4797	1	1
4798	32	32
4799	30	30
4800	35	35
4801	5	5
4802	5	5
4803	5	5
4804	5	5
4805	25	25
4806	2	2
4807	2	2
4808	1	1
4809	1	1
4810	1	1
4811	2	2
4812	2	2
4813	1	1
4814	7	7
4815	7	7
4816	2	2
4817	1	1
4818	15	15
4819	12	12
4820	1	1
4821	1	1
4822	1	1
4823	1	1
4824	3	3
4825	19	19
4826	23	23
4827	2	2
4828	2	2
4829	13	13
4830	16	16
4831	1	1
4832	13	13
4833	2	2
4834	19	19
4835	2	2
4836	1	1
4837	2	2
4838	1	1
4839	23	23
4840	13	13
4841	2	2
4842	17	17
4843	23	23
4844	2	2
4845	1	1
4846	8	8
4847	3	3
4848	1	1
4849	1	1
4850	2	2
4851	1	1
4852	3	3
4853	2	2
4854	4	4
4855	2	2
4856	7	7
4857	1	1
4858	48	48
4859	6	6
4860	2	2
4861	2	2
4862	2	2
4863	44	44
4864	2	2
4865	11	11
4866	25	25
4867	1	1
4868	2	2
4869	7	7
4870	3	3
4871	2	2
4872	4	4
4873	13	13
4874	1	1
4875	1	1
4876	1	1
4877	2	2
4878	1	1
4879	1	1
4880	1	1
4881	4	4
4882	1	1
4883	13	13
4884	39	39
4885	46	46
4886	3	3
4887	1	1
4888	4	4
4889	4	4
4890	1	1
4891	1	1
4892	2	2
4893	13	13
4894	3	3
4895	26	26
4896	2	2
4897	49	49
4898	2	2
4899	2	2
4900	2	2
4901	15	15
4902	36	36
4903	40	40
4904	4	4
4905	13	13
4906	13	13
4907	80	80
4908	4	4
4909	2	2
4910	2	2
4911	2	2
4912	1	1
4913	2	2
4914	2	2
4915	13	13
4916	13	13
4917	13	13
4918	26	26
4919	23	23
4920	4	4
4921	2	2
4922	2	2
4923	2	2
4924	2	2
4925	13	13
4926	13	13
4927	8	8
4928	4	4
4929	3	3
4930	2	2
4931	2	2
4932	12	12
4933	2	2
4934	12	12
4935	6	6
4936	4	4
4937	10	10
4938	3	3
4939	1	1
4940	1	1
4941	6	6
4942	6	6
4943	6	6
4944	3	3
4945	1	1
4946	10	10
4947	6	6
4948	2	2
4949	2	2
4950	1	1
4951	6	6
4952	12	12
4953	4	4
4954	4	4
4955	13	13
4956	2	2
4957	1	1
4958	20	20
4959	2	2
4960	26	26
4961	1	1
4962	1	1
4963	137	137
4964	13	13
4965	5	5
4966	2	2
4967	1	1
4968	1	1
4969	2	2
4970	3	3
4971	10	10
4972	92	92
4973	141	141
4974	11	11
4975	25	25
4976	7	7
4977	4	4
4978	1	1
4979	4	4
4980	2	2
4981	2	2
4982	2	2
4983	30	30
4984	2	2
4985	30	30
4986	164	164
4987	4	4
4988	2	2
4989	1	1
4990	2	2
4991	3	3
4992	1	1
4993	1	1
4994	1	1
4995	2	2
4996	2	2
4997	2	2
4998	2	2
4999	2	2
5000	26	26
5001	2	2
5002	13	13
5003	2	2
5004	1	1
5005	23	23
5006	1	1
5007	1	1
5008	1	1
5009	4	4
5010	1	1
5011	1	1
5012	2	2
5013	15	15
5014	2	2
5015	1	1
5016	3	3
5017	2	2
5018	1	1
5019	9	9
5020	1	1
5021	1	1
5022	15	15
5023	1	1
5024	1	1
5025	1	1
5026	1	1
5027	1	1
5028	13	13
5029	2	2
5030	13	13
5031	1	1
5032	2	2
5033	16	16
5034	1	1
5035	1	1
5036	2	2
5037	2	2
5038	13	13
5039	10	10
5040	2	2
5041	2	2
5042	3	3
5043	1	1
5044	1	1
5045	4	4
5046	1	1
5047	10	10
5048	3	3
5049	40	40
5050	7	7
5051	28	28
5052	9	9
5053	4	4
5054	19	19
5055	2	2
5056	13	13
5057	55	55
5058	1	1
5059	2	2
5060	4	4
5061	1	1
5062	273	273
5063	2	2
5064	1	1
5065	2	2
5066	4	4
5067	2	2
5068	9	9
5069	5	5
5070	1	1
5071	5	5
5072	1	1
5073	5	5
5074	13	13
5075	3	3
5076	13	13
5077	1	1
5078	1	1
5079	2	2
5080	1	1
5081	2	2
5082	4	4
5083	30	30
5084	23	23
5085	1	1
5086	1	1
5087	2	2
5088	3	3
5089	24	24
5090	5	5
5091	13	13
5092	2	2
5093	1	1
5094	13	13
5095	23	23
5096	15	15
5097	3	3
5098	3	3
5099	1	1
5100	1	1
5101	4	4
5102	1	1
5103	258	258
5104	29	29
5105	13	13
5106	1	1
5107	1	1
5108	14	14
5109	54	54
5110	3	3
5111	3	3
5112	1	1
5113	2	2
5114	2	2
5115	6	6
5116	6	6
5117	2	2
5118	2	2
5119	1	1
5120	1	1
5121	12	12
5122	14	14
5123	4	4
5124	200	200
5125	36	36
5126	25	25
5127	2	2
5128	10	10
5129	10	10
5130	4	4
5131	14	14
5132	14	14
5133	1	1
5134	12	12
5135	2	2
5136	13	13
5137	1	1
5138	1	1
5139	6	6
5140	2	2
